Revit 2026 API

# BuiltInFailuresPropertySetElementFailures Class

---

Failures related to property set elements.

SystemObject Autodesk.Revit.DBBuiltInFailuresPropertySetElementFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PropertySetElementFailures
```
```vb
Public NotInheritable Class PropertySetElementFailures
```
```cpp
public ref class PropertySetElementFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PropertySetElementFailures = class end
```

The BuiltInFailuresPropertySetElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmptyPropertySetName | A property set name cannot be an empty string. |
|  | NonStringParameterValue | The given parameter requires a string value. |
|  | NonUniquePropertySetName | The value of the given parameter is already in use as a property set name. |

#### Reference

Autodesk.Revit.DB Namespace